In [8]:
import pandas as pd 
import numpy as np

In [10]:
np.random.seed(100)
Seriel = pd.Series(np.random.rand(10))

In [15]:
Seriel

0    0.543405
1    0.278369
2    0.424518
3    0.844776
4    0.004719
5    0.121569
6    0.670749
7    0.825853
8    0.136707
9    0.575093
dtype: float64

In [17]:
type(Seriel)

pandas.core.series.Series

In [19]:
import calendar as cal

In [22]:
meses = [cal.month_name[i] for i in np.arange(1, 13)]
meses_seriel = pd.Series(np.arange(1, 13), index = meses)

In [24]:
meses_seriel

January       1
February      2
March         3
April         4
May           5
June          6
July          7
August        8
September     9
October      10
November     11
December     12
dtype: int32

In [25]:
meses_seriel.index

Index(['January', 'February', 'March', 'April', 'May', 'June', 'July',
       'August', 'September', 'October', 'November', 'December'],
      dtype='object')

# Dicionário com python

In [26]:
dict1 = {'US': 'Dollar', 'UK': 'pound', 'Germany': 'euro', 'Brasil': 'Real', 'China' : 'yan'}

In [27]:
moeda_series = pd.Series(dict1)

In [28]:
moeda_series

US         Dollar
UK          pound
Germany      euro
Brasil       Real
China         yan
dtype: object

In [29]:
stoockPrices = {'GOOG': 1092.23, 'FB': 59.78, 'TVTR': 67.31, 'AMIN': 342.90, 'AAPL': 501.60}

In [30]:
stoockPricesSeries = pd.Series(stoockPrices,
index= ['GOOG', 'FB','TVTR','AMIN', 'AAPL'],
name='stoockPrices')

In [31]:
stoockPricesSeries

GOOG    1092.23
FB        59.78
TVTR      67.31
AMIN     342.90
AAPL     501.60
Name: stoockPrices, dtype: float64

## Usando os valores escalares

In [32]:
humano = pd.Series('Homen', index=['pernas', 'troncos', 'peito', 'cabeças'])

In [33]:
humano

pernas     Homen
troncos    Homen
peito      Homen
cabeças    Homen
dtype: object

# Operação com séries

In [37]:
#Obtendo um único valor do processo
dict1['China']

'yan'

In [38]:
stoockPricesSeries['GOOG'] = 1300.00

In [39]:
stoockPricesSeries

GOOG    1300.00
FB        59.78
TVTR      67.31
AMIN     342.90
AAPL     501.60
Name: stoockPrices, dtype: float64

### Data Frame

In [45]:
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price','EPS','Shares Outstanding(M)', 
                                  'Beta', 'P/E','Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'Beta','P/E','Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E','Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                            index=['Closing price','EPS','Shares Outstanding(M)','P/E',
                                  'Market Cap(B)','Beta'])}

In [46]:
type(stock)

dict

In [47]:
stock_df = pd.DataFrame(stock)

In [48]:
stock_df

                         AMZN     GOOG       FB     YHOO    TWTR    AAPL
Beta                     0.52     0.87      NaN     0.66     NaN    0.84
Closing price          346.15  1133.43    61.48    34.90   65.25  501.53
EPS                      0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)          158.88   380.64   150.92    35.36   36.23  447.59
P/E                    589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)  459.00   335.83  2450.00  1010.00  555.20  892.45

In [49]:
stock_df = pd.DataFrame(stock, 
                        index = ['Closing price',
                                 'EPS', 
                                 'Shares Outstanding(M)',
                                 'P/E', 
                                 'Market Cap(B)',
                                 'Beta'])

In [50]:
stock_df

                         AMZN     GOOG       FB     YHOO    TWTR    AAPL
Closing price          346.15  1133.43    61.48    34.90   65.25  501.53
EPS                      0.59    36.05     0.59     1.27   -0.30   40.32
Shares Outstanding(M)  459.00   335.83  2450.00  1010.00  555.20  892.45
P/E                    589.80    31.44   104.93    27.48     NaN   12.44
Market Cap(B)          158.88   380.64   150.92    35.36   36.23  447.59
Beta                     0.52     0.87      NaN     0.66     NaN    0.84

In [51]:
stock_df.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [52]:
stock_df.columns

Index(['AMZN', 'GOOG', 'FB', 'YHOO', 'TWTR', 'AAPL'], dtype='object')

## Operação com DataFrame

In [53]:
Quadro_Medalhas_Rio_2016 = {
    'USA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Britain':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Russe':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Germany':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [54]:
Rio_2016 = pd.DataFrame.from_dict(Quadro_Medalhas_Rio_2016)

In [55]:
Rio_2016

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [56]:
type(Rio_2016)

pandas.core.frame.DataFrame

In [57]:
Medalhas_China = Rio_2016['China']

In [58]:
Medalhas_China

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [59]:
Medalhas_USA = Rio_2016['USA']

In [60]:
Medalhas_USA

Ouro      46
Prata     37
Bronze    38
Name: USA, dtype: int64

In [61]:
Rio_2016[['USA', 'China']]

        USA  China
Ouro     46     26
Prata    37     18
Bronze   38     26

In [62]:
Rio_2016[2:]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [63]:
Rio_2016[:2]

       USA  China  Britain  Russe  Germany
Ouro    46     26       27     19       17
Prata   37     18       23     18       10

In [64]:
Rio_2016[::2]

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Bronze   38     26       17     19       15

In [65]:
Rio_2016[::-1]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15
Prata    37     18       23     18       10
Ouro     46     26       27     19       17

# Slicing por Indexzação

In [66]:
Rio_2016.loc['Ouro']

USA        46
China      26
Britain    27
Russe      19
Germany    17
Name: Ouro, dtype: int64

In [67]:
Rio_2016.loc['Prata']

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Prata, dtype: int64